UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/СвязиКонтрагентКонтакт/СвязиКонтрагентКонтакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e2861b7a-4d37-4d36-a5b4-2245e8ec61da">
  <name>СвязиКонтрагентКонтакт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="11cd3a37-4efe-485c-8c2e-e30f6f3fefb1">
    <name>СвязьНедействительна</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="e563b4fc-c298-4536-ba17-05e9eec145c6">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9ec600b8-e08b-462b-966e-5a728376cd5a">
    <name>Контакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/ОсновныеДоговорыКонтрагента/ОсновныеДоговорыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="41d928f3-1fa4-43be-ab7e-a46d7695ed84">
  <name>ОсновныеДоговорыКонтрагента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d4312ce7-69c2-44c1-8318-c30c6dc90ff9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="f03eca1c-a94b-4a98-b48a-4ab3edee0404">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8d15bb45-c4b0-4c7a-842a-9c40d88e872d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="337d6cd7-6433-44a2-9149-c8148437e71c">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b6b4b04e-11e1-4863-abd0-935b3b246198">
  <name>ВидыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cbb74a99-a3de-4a04-b39c-0c5fdfc6a1b0">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1df639b-d0d6-4c5a-be9f-fe40514bb507">
    <name>ЮридическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="473e170d-f298-4de8-aa08-bb00f5100100">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="443de79e-3c1d-4498-b53e-77ce4b2a5167">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="827d8d4e-04aa-4b79-8d24-d0a641350c59">
  <name>ПолФизическогоЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6571518a-0757-49df-8580-0cbdacbe7ac6">
    <name>Мужской</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5a04279f-aa88-4a84-a26d-4ed80a391032">
    <name>Женский</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="35ac575d-3333-428d-bb00-ae2dd603b676">
  <name>ВидыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="79629720-62d2-4fb5-bfeb-bc994f7eee75">
    <name>СПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7cb6469b-2535-4307-9bd2-2e3739116c0b">
    <name>СКомиссионером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9d0532ff-e004-40d6-903e-ef428aaf3ff3">
    <name>СКомитентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособыЗаполненияСтавкиНДС/СпособыЗаполненияСтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d64145f0-65f1-4484-bb04-701d3b6c3eea">
  <name>СпособыЗаполненияСтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a02d789d-c4e9-412a-86da-cf2097b8848e">
    <name>Автоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособыЗачетаИРаспределенияПлатежей/СпособыЗачетаИРаспределенияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec7f89e5-9da1-40f9-97f2-338018f8f4a1">
  <name>СпособыЗачетаИРаспределенияПлатежей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="48e6d05e-8b3d-422a-9cd2-44f911caf9c9">
    <name>Авто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5fe38c36-f719-4f3a-9952-dc955b1590f6">
    <name>Вручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>саУНФ_СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДоставки</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="def7c5d9-841f-49c8-a2ab-a11c7b524370">
    <name>НомерТелефонаДляПоиска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_ЛК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d913c699-9b21-4f70-9e25-e7cd66899b35">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИОДиректора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7bfdd4f5-ffe7-4ecb-b402-405a8f1c112a">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0256d9ee-2e46-491e-949b-274e47734717">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b53e5f38-6df7-47fc-b690-eb2dee6eb3ca">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcd2476a-e93e-4236-a2fd-6b93ca54afa7">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d59d1b80-7147-4bb8-ace4-61a0365415ad">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39ac5143-3bca-4b85-8057-40fdbc360b37">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>id_adress</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3485b53-c447-4b51-8a87-ed842c7cd798">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Контрагенты</owners>
  <attributes extendedConfigurationObject="ceaaccdd-24f3-48bc-b2b8-66b76e6302fd">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a14f4886-8731-4ec3-bb1f-6435044f2843">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/CommonForms/КонтактыЮрЛица/Module.bsl
#Область ВспомогательныеФункции

&НаСервере
Функция ВидКИТелефон()
	
	Возврат   Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	
КонецФункции // ()

&НаСервере
Функция ПолучитьСтруктуруТелефона(ЗначениеJSON)
	ОМ_Ремонт = ОбщегоНазначения.ОбщийМодуль("сфУНФ_РемонтБатарей");
	Если НЕ ОМ_Ремонт =Неопределено Тогда
		Возврат ОМ_Ремонт.фПрочитатьJSON(ЗначениеJSON);
	Иначе
		Возврат "";
	КонецЕсли; 
КонецФункции // ()

&НаСервере
Функция ПроверитьСтруктуру()
	ТекстВозврата = "Телефон введен не верно. Введите телефон в формате +375 29 123-34-45";
	
	Если СтруктураТелефона=Неопределено Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	Если НЕ ТипЗнч(СтруктураТелефона) = Тип("Структура") Тогда	
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	Если НЕ СтруктураТелефона.Свойство("Значение") Тогда
		Возврат ТекстВозврата;
	КонецЕсли;		
	
	Если НЕ СтруктураТелефона.Свойство("Представление") Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	Если ПустаяСтрока(СтруктураТелефона.Представление)  Тогда
		Возврат ТекстВозврата;
	КонецЕсли;
	
	
	Если Лев(СокрЛП(СтруктураТелефона.Значение),1) ="{" Тогда
		СтруктураПоиска = ПолучитьСтруктуруТелефона(СтруктураТелефона.Значение); 
	Иначе			          
		Возврат  ТекстВозврата;
	КонецЕсли;						
	
	Если НЕ СтруктураПоиска.Свойство("countryCode") Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	КодСтраны = СокрЛП(СтруктураПоиска.countryCode);
	Если ПустаяСтрока(КодСтраны) ИЛИ  Лев(КодСтраны,1) <>"+" Тогда
		Возврат "Код страны должен начинаться с +";
	КонецЕсли;	
	
	Если НЕ СтруктураПоиска.Свойство("areaCode") Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	КодГорода = СокрЛП(СтруктураПоиска.areaCode);
	Если ПустаяСтрока(КодГорода)  Тогда
		Возврат "Нужно ввести код города"
	КонецЕсли;	
	
	
	Если НЕ СтруктураПоиска.Свойство("number") Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	НомерТел = СокрЛП(СтруктураПоиска.number);
	Если ПустаяСтрока(НомерТел)  Тогда
		Возврат ТекстВозврата;
	КонецЕсли;	
	
	Если СтрДлина(ПреобразоватьТелефон(НомерТел)) <>7 Тогда
		Возврат "В номере должно быть 7 цифр"
	КонецЕсли;	
	
	Дефис=СтрНайти(НомерТел,"-");
	
	Если Дефис>0 И Дефис<=3 Тогда
		//Номер телефона должен начинаться с 123- или без дефиса. Неправильно 12-3 
		Возврат ТекстВозврата;;
	КонецЕсли;
	
	Возврат "ОК";
КонецФункции // ()



&НаСервере 
Функция  НайтиКонтрагентаПоНомеруТелефона(Тел)
	СписокКонтрагентов = Новый СписокЗначений;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Вид = &Вид
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ВидКонтрагента = &ФизЛицо
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО ""%"" + &ТриСимвола + ""%""";
	
	Запрос.УстановитьПараметр("ТриСимвола", ЛЕВ(Тел,3));
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Запрос.УстановитьПараметр("ФизЛицо", Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
	
	ТелПоиска = ПреобразоватьТелефон(Тел); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка =  РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерТелефонаБезКодов=Выборка.НомерТелефонаБезКодов;
		Если ПРАВ(ПреобразоватьТелефон(НомерТелефонаБезКодов),7) = ТелПоиска Тогда
			СписокКонтрагентов.Добавить(Выборка.Ссылка);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат  СписокКонтрагентов;
КонецФункции


&НаКлиенте
Процедура СообщитьНеправильныйТелефон(Тел)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Ничего не понимаю! "+Тел;
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТелефон(Тел)
	Тел = СокрЛП(Тел);
	Тел = СтрЗаменить(Тел,"-","");
	Тел = СтрЗаменить(Тел," ","");
	Возврат Тел;
	
КонецФункции // ()



#КонецОбласти 

#Область ПоискПоТелефону

&НаКлиенте
Процедура НомерТелефонаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефона,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефона,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СтруктураТелефона = ВыбранноеЗначение;
	
	Флаг = ПроверитьСтруктуру();
	Если Флаг <>"ОК"  Тогда
		СообщитьНеправильныйТелефон(Флаг);
		НомерТелефона="";
		Возврат;
	КонецЕсли; 
	
	НомерТелефона=СтруктураТелефона.Представление;	
	СписокКонтрагентов = НайтиКонтрагентаПоНомеруТелефона(СтруктураПоиска.number);
	Если НЕ СписокКонтрагентов.Количество() =0 тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияСозданияКонтрагента",ЭтаФорма, );
		ПоказатьВыборИзСписка(ОписаниеОповещения,СписокКонтрагентов,Элементы.НомерТелефона);
	Иначе	
		ТекстВопроса = "По телефону клиент не найден. Хотите ввести нового клиента?";
		ЗадатьВопросОВводеНовогоКлиента(ТекстВопроса);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результат,ДопПараметры)  Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
	         Возврат;
	КонецЕсли; 
	Если Результат.Свойство("Контрагент") Тогда
		Возврат;
	КонецЕсли;
		 
	СтруктураТелефона = Результат;
	Флаг = ПроверитьСтруктуру();
	Если Флаг <>"ОК"  Тогда
		СообщитьНеправильныйТелефон(Флаг);
		НомерТелефонаКлиента="";
		Возврат;
	КонецЕсли; 
	
	НомерТелефонаКлиента=СтруктураТелефона.Представление;	
КонецПроцедуры

#КонецОбласти 


#Область ВводМобильного

&НаКлиенте
Процедура НомерТелефонаКлиентаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	
	Флаг =  ПроверитьСтруктуру();
	Если Флаг ="ОК" Тогда
		П.Вставить("Значение",СтруктураТелефона.Значение);
	КонецЕсли; 
	
	
	
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефонаКлиента,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	
	Флаг =  ПроверитьСтруктуру();
	Если Флаг ="ОК" Тогда
		П.Вставить("Значение",СтруктураТелефона.Значение);
	КонецЕсли; 
	
	
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефонаКлиента,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаКлиентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СтруктураТелефона = ВыбранноеЗначение;
	
	Флаг = ПроверитьСтруктуру();
	Если Флаг <>"ОК"  Тогда
		СообщитьНеправильныйТелефон(Флаг);
		НомерТелефонаКлиента="";
		Возврат;
	КонецЕсли; 
	
	НомерТелефонаКлиента=СтруктураТелефона.Представление;	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаКлиентаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефонаКлиента,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры



#КонецОбласти 

#Область ВводНовогоКлиента

&НаКлиенте
Процедура ПослеЗакрытияВопросаОНовомКлиенте(Результат, Параметры) Экспорт
	ОчиститьСообщения();
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		НовыйКлиент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСуществующемКлиенте(Результат, Параметры) Экспорт
	ОчиститьСообщения();
	Если Результат = "Выбрать" Тогда
		ОповеститьОВыборе(Параметры);
	Иначе
		НовыйКлиент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОВводеНовогоКлиента(ТекстВопроса)
	Режим = РежимДиалогаВопрос.ДаНет;
	П = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОНовомКлиенте", ЭтотОбъект, П);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещенияСозданияКонтрагента(ЗначениеВыбора, ДопПараметры) Экспорт
	Если ЗначениеВыбора=Неопределено Тогда
		ТекстВопроса = "Вы ничего не выбрали. Хотите ввести нового клиента?";
		ЗадатьВопросОВводеНовогоКлиента(ТекстВопроса);
	Иначе
		ТекстВопроса = "Выбрать "+СТРОКА(ЗначениеВыбора)+" или  хотите ввести нового клиента?";
		//Режим = РежимДиалогаВопрос.ДаНет;
		Режим =  Новый СписокЗначений;
		Режим.Добавить("Выбрать","Выбрать");
		Режим.Добавить("Нового","Ввести нового");
		П = Новый Структура("Контрагент",ЗначениеВыбора);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСуществующемКлиенте", ЭтотОбъект, П);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	КонецЕсли; 
	
	
КонецПроцедуры




&НаСервере
Процедура НовыйКлиент()
	Элементы.СтраницаНомерТелефона.Видимость=Ложь;
	Элементы.СтраницаНовыйКонтрагент.Видимость=Истина;
	
	Флаг = ПроверитьСтруктуру();
	Если Флаг ="ОК"  Тогда
		
		НомерТелефонаКлиента=СтруктураТелефона.Представление;
		
	КонецЕсли; 
	
	Пол = Перечисления.ПолФизическогоЛица.Мужской;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФИО()
	ОМ_Ремонт = ОбщегоНазначения.ОбщийМодуль("сфУНФ_РемонтБатарей");
	Если НЕ ОМ_Ремонт =Неопределено Тогда
		Возврат ОМ_Ремонт.ФИО(Фамилия,Имя,Отчество);
	Иначе
		Возврат "";
	КонецЕсли; 
КонецФункции // ()

&НаСервере
Функция ПроверитьМыло()
	ОМ_Ремонт = ОбщегоНазначения.ОбщийМодуль("сфУНФ_РемонтБатарей");
	Если НЕ ОМ_Ремонт =Неопределено Тогда
		Возврат ОМ_Ремонт.EmailValid(Мыло)
	Иначе
		Возврат Истина;
		
	КонецЕсли; 
КонецФункции // 

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ФИО=ПолучитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ФИО=ПолучитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ФИО=ПолучитьФИО();
КонецПроцедуры

&НаСервере
Функция ПроверитьОбязательныеПоля()
	Если ПустаяСтрока(НомерТелефонаКлиента) Тогда
		Возврат "Не введен мобильный телефон";
	КонецЕсли;
	Если ПустаяСтрока(Фамилия) Тогда
		Возврат "Не введена фамилия";
	КонецЕсли;
	Если ПустаяСтрока(Имя) Тогда
		Возврат "Не введено имя";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Пол) Тогда
		Возврат "Не введен пол клиента";
	КонецЕсли;
	
	Возврат "ОК"
КонецФункции // ()


&НаСервере
Функция ВвестиНовогоНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ГруппаСЦ=Справочники.Контрагенты.НайтиПоНаименованию("Клиенты РТТ");
	Если ГруппаСЦ = Справочники.Контрагенты.ПустаяСсылка() Тогда
		ГруппаСЦОбъект = Справочники.Контрагенты.СоздатьГруппу();
		ГруппаСЦОбъект.Наименование ="Клиенты РТТ";
		ГруппаСЦОбъект.Записать();
		ГруппаСЦ=ГруппаСЦОбъект.Ссылка;
	КонецЕсли; 
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	
	Если НЕ ГруппаСЦ =Справочники.Контрагенты.ПустаяСсылка() Тогда
		НовыйКонтрагент.Родитель =  ГруппаСЦ;
	КонецЕсли; 
	
	НовыйКонтрагент.Наименование 				= 	Наименование;
	НовыйКонтрагент.НаименованиеПолное 	= 	НаименованиеПолное;
	НовыйКонтрагент.Покупатель 					= 	Истина;
	НовыйКонтрагент.ВидКонтрагента 			= 	Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	НовыйКонтрагент.ИНН								=	ИНН;				
	
	НовыйКонтрагент.ФИО = ФИО;
	НовыйКонтрагент.Комментарий = "Создан  программно при оформлении продажи на РТТ ";
	НовыйКонтрагент.ОбменДанными.Загрузка = Истина;
	НовыйКонтрагент.ВестиРасчетыПоЗаказам = Истина;
	НовыйКонтрагент.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	НовыйКонтрагент.ГруппаДоступа = Справочники.ГруппыДоступаКонтрагентов.ГруппаДоступаПоУмолчанию();
	НовыйКонтрагент.ВалютаРасчетовПоУмолчанию = Константы.НациональнаяВалюта.Получить();
	НовыйКонтрагент.СпособЗачетаПредоплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособЗачетаПредоплатыПоУмолчанию();
	НовыйКонтрагент.СпособРазнесенияОплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособРазнесенияОплатыПоУмолчанию();
	
	НовыйКонтрагент.ВестиРасчетыПоДоговорам              	=	Истина;
	
	НовыйКонтрагент.СтатьяДДСПоУмолчанию                  	=	Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
	НовыйКонтрагент.СчетУчетаАвансовПокупателя           	=	ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателем     	=	ПланыСчетов.Управленческий.РасчетыСПокупателями;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщиком     =	ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	НовыйКонтрагент.СчетУчетаАвансовПоставщику			=	ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	НовыйКонтрагент.Пол 													= 	Пол;
		
	
	НовыйКонтрагент.КонтактнаяИнформация.Очистить();
	
		
	ТелКИ 											= 	НовыйКонтрагент.КонтактнаяИнформация.Добавить();
	ТелКИ.Тип 									= 	Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТелКИ.Вид 									= 	Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	ТелКИ.ЗначенияПолей 					= 	СтруктураТелефона.КонтактнаяИнформация;
	ТелКИ.Значение 							=  СтруктураТелефона.Значение;
	
	НовыйКонтрагент.НомерТелефонаДляПоиска  = ТелКИ.Представление;
	НовыйКонтрагент.СтранаРегистрации  = Справочники.СтраныМира.НайтиПоКоду("112");
	
	Если ТипЗнч(СтруктураПоиска)=Тип("Структура") Тогда
		Если СтруктураПоиска.Свойство("value") И СтруктураПоиска.Свойство("number") И СтруктураПоиска.Свойство("countryCode") Тогда
			ТелКИ.НомерТелефона 					= 	СтруктураПоиска.value;
			ТелКИ.НомерТелефонаБезКодов 	=	СтруктураПоиска.number;
			ТелКИ.Представление  					=  СтруктураПоиска.value;
		КонецЕсли; 
		
		Если СтруктураПоиска.countryCode="+375" Тогда
			НовыйКонтрагент.СтранаРегистрации  = Справочники.СтраныМира.НайтиПоКоду("112");
		ИначеЕсли СтруктураПоиска.countryCode="+7" Тогда
			НовыйКонтрагент.СтранаРегистрации  =Справочники.СтраныМира.Россия;
		КонецЕсли; 
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Мыло) Тогда
		МылоКИ = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
		МылоКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МылоКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		МылоКИ.АдресЭП = Мыло;	
		МылоКИ.Представление = Мыло;  
		НовыйКонтрагент.АдресЭПДляПоиска  =Мыло; 
	КонецЕсли;
	НовыйКонтрагент.ДатаСоздания  = ТекущаяДата();
	
	СвойствоДоп = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сегмент");
	Если СвойствоДоп<>ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка() Тогда
		РемонтАКБ = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Торговля",Ложь);
		Если  РемонтАКБ = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка() Тогда
			РемонтАКБОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			РемонтАКБОбъект.Наименование ="Торговля"; 
			РемонтАКБОбъект.ПолноеНаименование =  "Торговля"; 
			РемонтАКБОбъект.Владелец =  СвойствоДоп;
			РемонтАКБОбъект.Записать();
			РемонтАКБ = РемонтАКБОбъект.Ссылка;
		КонецЕсли; 
		НовыйКонтрагент.ДополнительныеРеквизиты.Очистить();;
		НовоеДопСвойство = НовыйКонтрагент.ДополнительныеРеквизиты.Добавить();
		НовоеДопСвойство.Свойство =  СвойствоДоп;
		НовоеДопСвойство.Значение = РемонтАКБ;
		НовоеДопСвойство.ТекстоваяСтрока =  "Торговля";
	КонецЕсли; 
	НовыйКонтрагентСсылка = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор);
    НовыйКонтрагент.УстановитьСсылкуНового(НовыйКонтрагентСсылка);
	
	//НовыйКонтрагентСсылка =	НовыйКонтрагент.Ссылка;
	//Контактное лицо
	КонтактОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
	КонтактОбъект.ДатаСоздания                     		=	НовыйКонтрагентСсылка.ДатаСоздания;
	КонтактОбъект.Комментарий                      		=	НовыйКонтрагентСсылка.Комментарий;
	КонтактОбъект.НомерТелефонаДляПоиска       	=	НовыйКонтрагентСсылка.НомерТелефонаДляПоиска;
	КонтактОбъект.Ответственный                    		=	НовыйКонтрагентСсылка.Ответственный;
	КонтактОбъект.Пол                              				=	НовыйКонтрагентСсылка.Пол;
	КонтактОбъект.Наименование 							= 	ФИО;
	КонтактОбъект.Записать();
	
	КонтактОбъект.КонтактнаяИнформация.Очистить();
	ТелКИ 													= 	КонтактОбъект.КонтактнаяИнформация.Добавить();
	ТелКИ.Тип 											= 	Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТелКИ.Вид 											= 	Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	Если ТипЗнч(СтруктураПоиска)=Тип("Структура") Тогда
		Если СтруктураПоиска.Свойство("value") И СтруктураПоиска.Свойство("number") И СтруктураПоиска.Свойство("countryCode") Тогда
			
			ТелКИ.НомерТелефона 							= 	СтруктураПоиска.value;
			ТелКИ.НомерТелефонаБезКодов 			=	СтруктураПоиска.number;
			ТелКИ.Представление  							=  СтруктураПоиска.value;
			
			ТелКИ.ЗначенияПолей 							= 	СтруктураТелефона.КонтактнаяИнформация;
			ТелКИ.Значение 									=  СтруктураТелефона.Значение;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Мыло) Тогда
		МылоКИ 											= КонтактОбъект.КонтактнаяИнформация.Добавить();
		МылоКИ.Тип 										= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МылоКИ.Вид 									= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		МылоКИ.АдресЭП 							= Мыло;	
		МылоКИ.Представление 					= Мыло;  
		КонтактОбъект.АдресЭПДляПоиска   = Мыло;
	КонецЕсли;
	КонтактОбъект.Записать();
	
	РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(НовыйКонтрагентСсылка, КонтактОбъект.Ссылка, "",,);
	
	НовыйКонтрагент.КонтактноеЛицо                    =  КонтактОбъект.Ссылка;
	
	
	НовыйКонтрагент.СформироватьОсновныеСведения(); 
	Попытка
	      НовыйКонтрагент.Записать();
	Исключение
	       Возврат Ложь;
	КонецПопытки;

	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовыйКонтрагент.Ссылка,ЮрАдрес,
	Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,,Истина);

	
	Контрагент = НовыйКонтрагент.Ссылка;
	СоздатьНовыйДоговор(Контрагент);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Контрагент;
КонецФункции

&НаСервере
Функция СоздатьНовыйДоговор(Контрагент)
    НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();		
	ОрганизацияПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
		НовыйДоговор.Организация = ОрганизацияПоУмолчанию;
	Иначе
		НовыйДоговор.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	НовыйДоговор.Владелец = Контрагент;
	НовыйДоговор.Наименование = "договор с "+СокрЛП(Контрагент.Наименование);
	НовыйДоговор.ВалютаРасчетов                                      		=    Константы.НациональнаяВалюта.Получить();
	НовыйДоговор.ВидДоговора                                           		=    Перечисления.ВидыДоговоров.СПокупателем;
	НовыйДоговор.ДатаДоговора                                          		=    ТекущаяДата();
	НовыйДоговор.Комментарий                                           		=    "Введен при покупке из РТТ";
	НовыйДоговор.НомерДоговора                                       		=    Контрагент.Код;
	НовыйДоговор.СпособЗаполненияСтавкиНДС                 		=   Перечисления.СпособыЗаполненияСтавкиНДС.Автоматически;
	НовыйДоговор.СпособЗачетаПредоплатыПоУмолчанию    		=    Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную;
	НовыйДоговор.СпособРазнесенияОплатыПоУмолчанию    	=    Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную;
	НовыйДоговор.СрокДействия                                           		=    Дата(1,1,1);
	НовыйДоговор.СрокОплатыПокупателя                               	=   3;
	НовыйДоговор.СтатьяДДСПоУмолчанию                             	=    Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
	 
	ВидЦенПродажи = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.АвторизованныйПользователь(), "ОсновнойВидЦенПродажи");
	
	Если ЗначениеЗаполнено(ВидЦенПродажи) Тогда
		НовыйДоговор.ВидЦен = ВидЦенПродажи;
	КонецЕсли;
    НовыйДоговор.ПакОтветственный   =   Контрагент.Ответственный;

	Попытка
	
		НовыйДоговор.Записать();
	    НаборЗаписей=РегистрыСведений.ОсновныеДоговорыКонтрагента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(НовыйДоговор.Ссылка.Организация);
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
		НаборЗаписей.Отбор.ВидДоговора.Установить(НовыйДоговор.Ссылка.ВидДоговора); 
		
		
		
		
		НаборЗаписей.Записать();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Организация          	=    НовыйДоговор.Ссылка.Организация;
		Запись.Контрагент             	=    Контрагент;
		Запись.ВидДоговора         	=    НовыйДоговор.Ссылка.ВидДоговора;
		Запись.Договор                 	=    НовыйДоговор.Ссылка;
		
		НаборЗаписей.Записать();

		
	Исключение
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Договор не удалось записать.'"),, ,, Отказ);
	КонецПопытки;			
		
	

КонецФункции // ()


&НаКлиенте
Процедура ВвестиНового(Команда)
	Флаг = ПроверитьСтруктуру();
	Если Флаг <>"ОК"  Тогда
		СообщитьНеправильныйТелефон(Флаг);
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Мыло) И НЕ ПроверитьМыло() Тогда
		СообщитьНеправильныйТелефон("Не корректно введен e-mail");
		Возврат;
	КонецЕсли;
	
	Флаг = ПроверитьОбязательныеПоля();
	Если Флаг <>"ОК"  Тогда
		СообщитьНеправильныйТелефон(Флаг);
		Возврат;
	КонецЕсли;
	
	
	Контрагент=ВвестиНовогоНаСервере();
	Если ТипЗнч(Контрагент) = Тип("Булево") Тогда
	      ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось создать контрагента.'"),, ,, );
	КонецЕсли; 
	
	
	СтруктураКонтрагента = Новый Структура("Контрагент",Контрагент); 
	 //ОповеститьОВыборе(СтруктураКонтрагента);
	 
	  Оповестить("ВведенКонтрагент",СтруктураКонтрагента);
	  Закрыть();
КонецПроцедуры


#КонецОбласти 





&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СтраницаНомерТелефона.Видимость=Ложь;
	Элементы.СтраницаНовыйКонтрагент.Видимость=Истина;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	П = Новый Структура("ВидКонтактнойИнформации",ВидКИТелефон());
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", П, Элементы.НомерТелефона,
	УникальныйИдентификатор,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьКодыСтраныИГорода()
	СписокКодовГорода = Новый Массив;
	СписокКодовГорода.Добавить("25");
	СписокКодовГорода.Добавить("29");
	СписокКодовГорода.Добавить("33");
	СписокКодовГорода.Добавить("44");
	
	КодыСтраныИГорода = Новый Структура("КодСтраны,КодГорода,СписокКодовГорода","+375","33",СписокКодовГорода);
	Возврат КодыСтраныИГорода;
	
КонецФункции // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИНН") Тогда
		ИНН 								=  Параметры.ИНН;
		Наименование 				=  Параметры.Наименование;
		НаименованиеПолное 	=  Параметры.НаименованиеПолное;
		ЮрАдрес 						=  Параметры.ЮрАдрес;
		
		ХранилищеОбщихНастроек.Сохранить("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", "КодыСтраныИГорода", ПолучитьКодыСтраныИГорода());
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Что то пошло не так.'"),, ,, Истина);
		Закрыть();
	КонецЕсли; 
КонецПроцедуры
